////////     - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
//     (в першу, другу, третю или четверту частину години).
// let Time = +prompt ('введіть число від 0 до 59');
// if (Time<=15){document.write('перша чверть');}
//     else if (Time>15 && Time<=30)
//
//     // console.log('друга чверть')
//     //(чи є різниця де виводити результат? на консоль чи в браузер? як тут.)
//     {document.write('друга чверть');}
//
//     else if (Time>31 && Time<=45)
//     {document.write('третя чверть');}
//     else if (Time>45 && Time<=59)
//     {document.write('четверта чверть');}
// else if (Time>59){document.write('ПЕРЕБОР');}




//////// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
//дуже дуже дуже схоже на перше завдання, тому я його копірнув та відкоригував.
// let Day = +prompt ('введіть число від 1 до 31');
// if (Day<=10){document.write('перша декада');}
//     else if (Day>10 && Day<=20)
//     {document.write('друга декада');}
//     else if (Day>20 && Day<=31)
//     {document.write('третя декада');}
//     else if (Day>31){document.write('ПЕРЕБОР');}








///////////// - У нас є змінна test, якщо  не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
// Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
// let test=confirm('Янукович президент');
// document.write('')
// if (test === true){document.write('Неправильно');}
// else {document.write('Вірно');







///////     - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
// let A=+prompt('введіть число від -5 до 5');
// if (A===-3){document.write('невірно');}
// else {document.write('вірно');}






////////    - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.
// let days= +prompt('який день вас цікавить?');
// switch (days) {
//     case 1:
//     console.log('Понеділок день тяжкий');
//     break;
//     case 2:
//         console.log('Вівторок легший');
//     break;
//     case 3:
//         console.log('Середа по середині');
//     break;
//     case 4:
//         console.log('Завтра пятниця');
//     break;
//     case 5:
//         console.log('Сьогодні бухаєм');
//     break;
//     case 6:
//         console.log('Шашлик');
//     break;
//     case 7:
//         console.log('Відходимо');
//     break;}
// //спочатку всі дні були словами, але довго писати. подивився у відповіді і поставив цифри.




//////////     - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
// let year=+prompt('наберіть рік і дізнаєтесь чи він високосний');
// if (year%4===0) {console.log('Рік високосний')}
// else if (year!==4)
// {console.log('Звичайний рік')}






/////////////    - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
// let name=prompt('яка офіційна назва JavaScript?');
// if (name==='ECMAScript'){console.log('Правильно')}
// else if(name!=='ECMAScript')
// {console.log('Не знаєте? ECMAScript!')}
