/////// 1. Створити масив з 10 чисел (можна використовувати Math.random Та Math.floor). Скласти результат цих чисел в змінній result.--
// let mus = [1,2,3,4,12,23,11,22,33,44,];
// let result=( mus[0]+mus[1]+mus[2]+mus[3]+mus[4]+mus[5]+mus[6]+mus[7]+mus[8]+mus[9]);
// console.log(mus);




// /////// 2. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр, автори
// let nameBook1='Кримінальний кодекс';
// let pageBook1= 1001;
// let genreBook1='це не наукова література';
// let authorsBook1='створено людьми';
// console.log(nameBook1,genreBook1)





/////////// 3. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр, автори
// let book2={
//     name:'Камасутра',
//     page:1001,
//     genre:'наукова література',
//     authors:'people'
// }
// console.log(book2.name);





//////////// 4. Створити масив об'єктів book з наступними полями  - назва, кількість сторінок, жанр, автори. Вивести кожну книгу як окремий об'єкт
// let book1= {
//     name:'ПДР',
//     page:99,
//     genre:'Правила',
//     author:'Поліція'
//         }
// let book2= {
//     name:'Рецепти',
//     page:99,
//     genre:'Наукова фантастика',
//     author:'Народи світу'
//         }
// let book3= {
//     name:'Закон',
//     page:999,
//     genre:'Правила, закони',
//     author:'Поліція'
//         }
// let book4= {
//     name:'Буквар',
//     page:199,
//     genre:'Наукова література',
//     author:'Народ'
//         }
// let book5= {
//     name:'Математика',
//     page:599,
//     genre:'Наукова література та цифри',
//     author:'Люди'
//         }
// let librari = [book1, book2, book3, book4, book5];
// console.log(librari[0]);
// console.log(librari[0][3]);
//пробував ставити після [0] ще [3] нічого не показує. то так і треба, чи я щось намутив?
//хотів щоб показало book1 та book4 одночасно, не працює.
// console.log(book2.genre);
// console.log(book4.name);




// // 5. Напишіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
// // Значення площі зберігати в змінній s.
//let height=23;
// let width=10;
// let s=height*width;
// console.log(s)





// --6. Напиши код, який знаходить об'єм циліндра заввишки 10м (змінна heightC) та діаметром основи 5м (dC),
//-- результат помістіть у змінну v.
// --hC=10m,  dC=4m,  rC=dC/2
// --формула знаходження об'єму циліндра = PI*(R**2)*h
//---3.1415*((5/2)**2)*10=3.1415*6.25*10=*10=196.34375
// let pi=3.1415
// let hC = +prompt('height');
// let dC = +prompt('diameter');
// let rC=dC/2;
// let v=pi*(rC**2)*hC;
// alert(pi*(rC**2)*hC);
// console.log(v)



//// 7. У прямокутного трикутника дві сторони n (зі значенням 3) та m (зі значенням 4)
//// Знайдіть гіпотенузу k за теоремою Піфагора (потрібно використовувати функцію Math.pow (число, ступінь) або оператор зведення в ступінь **)
// (a**2)+(b**2)=(c**2)--a=n,  b=m,  c=k.
// let n=Math.pow(3,2);
// let m=Math.pow(4,2);
// let s=n+m;
// let k=Math.sqrt(s);
// alert(k);
// console.log(k)


// Ваше завдання, зробити так, щоб файл відкривався без помилок .



//я люблю головоломки, але ця полюбила мене.
// let a = 100;
// let b = 500;
// let c = "hello";
// let d = "okten";
// const x = 'constant value';
// {
//     console.log(a);
//     x = 'new value';
// }
// let b = 'new value';
//
// let result = 100 + y;
//
// console(result);






